In [2]:
# This notebook is just to explore the data.
# the main application code is in the python file

In [3]:
import time
import pandas as pd
import numpy as np

In [4]:
data=pd.read_csv('chicago.csv')

In [5]:
data.head()

,Unnamed: 0,Start Time,End Time,Trip Duration,Start Station,End Station,User Type,Gender,Birth Year
0,1423854,2017-06-23 15:09:32,2017-06-23 15:14:53,321,Wood St & Hubbard St,Damen Ave & Chicago Ave,Subscriber,Male,1992.0
1,955915,2017-05-25 18:19:03,2017-05-25 18:45:53,1610,Theater on the Lake,Sheffield Ave & Waveland Ave,Subscriber,Female,1992.0
2,9031,2017-01-04 08:27:49,2017-01-04 08:34:45,416,May St & Taylor St,Wood St & Taylor St,Subscriber,Male,1981.0
3,304487,2017-03-06 13:49:38,2017-03-06 13:55:28,350,Christiana Ave & Lawrence Ave,St. Louis Ave & Balmoral Ave,Subscriber,Male,1986.0
4,45207,2017-01-17 14:53:07,2017-01-17 15:02:01,534,Clark St & Randolph St,Desplaines St & Jackson Blvd,Subscriber,Male,1975.0

In [6]:
data.columns

Index(['Unnamed: 0', 'Start Time', 'End Time', 'Trip Duration',
       'Start Station', 'End Station', 'User Type', 'Gender', 'Birth Year'],
      dtype='object')

In [7]:
data.describe()

         Unnamed: 0  Trip Duration     Birth Year
count  3.000000e+05  300000.000000  238981.000000
mean   7.763458e+05     936.239290    1980.858223
std    4.481464e+05    1548.792767      11.003329
min    4.000000e+00      60.000000    1899.000000
25%    3.871368e+05     393.000000    1975.000000
50%    7.771035e+05     670.000000    1984.000000
75%    1.164065e+06    1125.000000    1989.000000
max    1.551500e+06   86224.000000    2016.000000

In [8]:
start_time = data['Start Time'].astype(np.datetime64)
start_time.describe()

count                  300000
unique                 292758
top       2017-05-15 13:13:00
freq                        4
first     2017-01-01 00:07:57
last      2017-06-30 23:59:01
Name: Start Time, dtype: object

In [9]:
# get the most frequent Month
months = start_time.dt.month
months.median()

5.0

In [10]:
# get the most frequent day of the week
# The day of the week with Monday=0, Sunday=6
days = start_time.dt.weekday
days.median()

3.0

In [11]:
# get the most common start hour
hours = start_time.dt.hour
hours.median()

14.0

In [12]:
#filter data by month
data[data['Start Time'].astype(np.datetime64).dt.month == 5]

,Unnamed: 0,Start Time,End Time,Trip Duration,Start Station,End Station,User Type,Gender,Birth Year
1,955915,2017-05-25 18:19:03,2017-05-25 18:45:53,1610,Theater on the Lake,Sheffield Ave & Waveland Ave,Subscriber,Female,1992.0
6,961916,2017-05-26 09:41:44,2017-05-26 09:46:25,281,Ashland Ave & Lake St,Wood St & Hubbard St,Subscriber,Female,1983.0
13,1023296,2017-05-30 15:46:18,2017-05-30 15:52:12,354,Larrabee St & Kingsbury St,Clark St & Elm St,Subscriber,Male,1985.0
15,958716,2017-05-25 22:59:33,2017-05-25 23:07:19,466,Clark St & Armitage Ave,Sheffield Ave & Wrightwood Ave,Subscriber,Female,1985.0
16,718598,2017-05-03 13:20:38,2017-05-03 13:31:13,635,Ada St & Washington Blvd,Daley Center Plaza,Subscriber,Male,1967.0
...,...,...,...,...,...,...,...,...,...
299985,712351,2017-05-02 17:45:19,2017-05-02 17:52:00,401,Canal St & Monroe St (*),Milwaukee Ave & Grand Ave,Subscriber,Male,1991.0
299989,1005203,2017-05-29 13:45:56,2017-05-29 13:54:15,499,Green St & Madison St,Canal St & Taylor St,Customer,NaN,NaN
299991,723217,2017-05-03 19:15:23,2017-05-03 19:29:32,849,Milwaukee Ave & Wabansia Ave,Ashland Ave & Chicago Ave,Subscriber,Female,1982.0
299994,935129,2017-05-23 17:08:04,2017-05-23 17:11:37,213,Indiana Ave & 31st St,MLK Jr Dr & 29th St,Subscriber,Male,1988.0
299999,1021247,2017-05-30 12:38:28,2017-05-30 12:55:36,1028,Wacker Dr & Washington St,Damen Ave & Division St,Subscriber,Male,1984.0

In [50]:
#most commonly used start station
most_start_station = data['Start Station'].value_counts().keys()[0]
most_start_station

'Streeter Dr & Grand Ave'

In [59]:
# combine start and end trip
data['routes']= 'from ' + data['Start Station'] + ' to ' + data['End Station']
data['routes'].value_counts().keys()[0]

'from Lake Shore Dr & Monroe Stto Streeter Dr & Grand Ave'

In [67]:
# Calculate total travel time
data['Trip Duration'].mean()

float

In [68]:
#Calculate Total travel time
data['Trip Duration'].sum()

numpy.int64

In [81]:
# get user types
data['User Type'].value_counts()

Subscriber    238889
Customer       61110
Dependent          1
Name: User Type, dtype: int64

In [87]:
#get user Gender
data['Gender'].value_counts()

Male      181190
Female     57758
Name: Gender, dtype: int64